print("{} 평균 : {:.2f}".format("홍길동",(100+100+99)/3))
name = "홍길동"

### f 함수 소수점2자리 출력
a = 1.12345
print(f"소수점 2자리 출력 : {a:.2f}")

print("출력이 됩니다.!!")

print("""\
      1.즉 한화가 보유한 고려아연 지분이 최윤범 회장의 우호지분이 확실하고 자본시장과 금융투자에 
      
      관한 법(이하 자본시장법)상 공동행위자로 볼만한 여지가 있다면 최윤범 회장과 함께 지분을 묶#

      어 공시하지 않은 것은 공시위반이 될 수 있다는 것이다.""")# """ 은 친 그대로 나온다 , \는 공백을 제거한다.



#name = "홍길돌"
#num = 100
#num2 = 100
#num3 = 99
#print("%s 합계 : %d" % (name,num+num2+num3))
#print("{} 합계 : {}".format(name,num+num2+num3))
#print("%s 평균 : %.2f" % (name,(num+num2+num3)/3))
#print("{} 평균 : {:.2f}".format(name,(num+num2+num3)/3))

#숫자 : 12.12345 ,456.78940 , 2.252525
#소수점 2자리 출력
#숫자 : 12.12, 456.79, 2.25
#nu = 12.12345
#nu2 = 456.78940
#nu3 = 2.252525
#print("{:.2f},{:.2f},{:.2f}".format(nu,nu2,nu3))

#print("{2:d} {0:d} {1:d}".format(0,1,2))

#print("\"")# \를 넣으면 뒤를 문자로 입력해라
#print("안녕\n하세요.") #\n 행띄우기
#print("안녕\t하세요.") #\t 탭키 
#print("안녕\b 하세요.") #\b 뒤로 한칸
#rint("안녕\b  하세요.") #\b 뒤로 한칸

#print("즉 한화가 보유한 고려아연 지분이 최윤범 회장의 우호지분이 확실하고 자본시장과 금융투자에 \n관한 법(이하 자본시장법)상 공동행위자로 볼만한 여지가 있다면 최윤범 회장과 함께 지분을 묶\n어 공시하지 않은 것은 공시위반이 될 수 있다는 것이다. ")

